#+TITLE: Library of Babel

* Org-mode

** Babel

*** header arguments

#+NAME: ob-image-dir
#+begin_src emacs-lisp :cache no
(concat (file-name-directory (buffer-file-name)) "data/images/")
#+end_src

#+RESULTS: ob-image-dir
: /home/stardiviner/.emacs.d/Org-mode/Library of Babel/data/images/


** Export

*** landscape view
:PROPERTIES:
:header-args: :eval no
:END:

#+NAME: load-latex-package-pdflscape-original-data
#+begin_src shell :results silent :wrap landscape :var babel=""
echo "echo \"$babel\""
#+end_src

#+NAME: load-latex-package-pdflscape
#+begin_src shell :results raw output :exports none :var data="" :noweb yes
echo "#+LATEX_HEADER: \sepackage{pdflscape}"
<<load-latex-package-pdflscape-original-data(babel="hello")>>
#+end_src

#+RESULTS: load-latex-package-pdflscape

#+NAME: org-mode-export-landscape-view
#+begin_src shell :exports results :results raw :post load-latex-package-pdflscape(data=*this*)

#+end_src

#+RESULTS: org-mode-export-landscape-view
#+LATEX_HEADER: \sepackage{pdflscape}


* GnuPG

** get Key ID (fingerprint)

#+NAME: gpg-get-my-key-id
#+begin_src shell
gpg --list-key stardiviner | awk 'NR == 2 {print $1}' # get the last 16 characters as Key ID
#+end_src

** get user ID

#+NAME: gpg-get-my-user-id
#+begin_src shell
gpg --list-secret-keys | grep "uid" | head -n 1
#+end_src


* SSH

** get the ssh public key

#+NAME: ssh-get-public-key
#+begin_src shell
ssh-add -L
#+end_src

** get the fingerprint

#+NAME: ssh-get-fingerprint
#+begin_src shell
ssh-add -l
#+end_src


* Print

#+name: elisp-print
#+begin_src emacs-lisp :var name=""
(prin1 name)
#+end_src

#+NAME: sh-echo
#+begin_src shell :var input="stardiviner"
echo $input
#+end_src

#+NAME: ruby-print
#+begin_src ruby :var str="stardiviner"
puts str
#+end_src


* Docker

** get latest docker container name

#+NAME: docker-name-latest
#+begin_src shell
docker ps --format="{{.Names}}"
#+end_src


* Deluge

** local RPC daemon account

#+NAME: deluge-daemon-username
#+begin_src shell
cat ~/.config/deluge/auth | cut -d ":" -f 1
#+end_src

#+RESULTS: deluge-daemon-username
: localclient

#+NAME: deluge-daemon-password
#+begin_src shell
cat ~/.config/deluge/auth | cut -d ":" -f 2
#+end_src

#+RESULTS: deluge-daemon-password
: 9b83ceded9ac08cc5c7403b093115874a6086958

